app/controllers/recipes_controller.rb

SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "recipes" ("name", "summary", "description", "chef_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        @recipe = Recipe.new(recipe_params)
        @recipe.chef = Chef.find(2)

        if @recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "recipes" SET "name" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", "Edited - this is a new recipe"], ["updated_at", "2016-01-14 09:31:38.204176"], ["id", 2]]
---
    def update
        @recipe = Recipe.find(params[:id])
        if @recipe.update(recipe_params)